app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "birth_year", "death_year", "paint", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @artist = Artist.new(artist_params)

        if @artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "artists" SET "nationality" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["nationality", "Edward Munch"], ["updated_at", "2020-11-20 04:37:57.044061"], ["id", 7]]
---
    def update
        @artist = Artist.find(params[:id])

        if @artist.update(artist_params)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 9]]
---
    def destroy
        @artist = Artist.find(params[:id])
        @artist.destroy