app/controllers/locations_controller.rb

INSERT INTO "locations" ("place", "title", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["place", "woenht"], ["title", "fcygvhbujnk"], ["name", "gvhbjn"], ["created_at", "2020-11-18 23:37:29.362748"], ["updated_at", "2020-11-18 23:37:29.362748"]]
---
    def create
        @location = Location.new(location_params)

        if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "locations" SET "place" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["place", "The National Museum of Art, Architecture, and Design in Oslo"], ["updated_at", "2020-11-20 02:46:49.746480"], ["id", 3]]
---
    def update
        @location = Location.find(params[:id])

        if @location.update(location_params)

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]
---
    def destroy
        @location = Location.find(params[:id])
        @location.destroy