app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
    def index
        @paintings = Painting.all

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @painting = Painting.find(params[:id])

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @painting = Painting.find(params[:id])

INSERT INTO "paintings" ("title", "name", "era", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Mona Lisa"], ["name", "Leonardo da Vinci"], ["era", "1500s"], ["location", "The Louve"], ["created_at", "2020-11-19 04:08:14.068836"], ["updated_at", "2020-11-19 04:08:14.068836"]]
---
    def create
        @painting = Painting.new(painting_params)

        if @painting.save

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "paintings" WHERE "paintings"."id" = ?  [["id", 1]]
---
    def destroy
        @painting = Painting.find(params[:id])
        @painting.destroy