app/views/locations/show.html.erb

SELECT "artists".* FROM "artists" INNER JOIN "artists_locations" ON "artists"."id" = "artists_locations"."artist_id" WHERE "artists_locations"."location_id" = ?  [["location_id", 2]]
---
		<tr>
  	<% @location.artists.each do |artist| %>